# Introduction

Pandas (in addition to Numpy) is the go-to Python library for all your data science needs. It helps with dealing with input data in CSV formats and with transforming your data into a form where it can be inputted into ML models. However, getting comfortable with the ideas of dataframes, slicing, etc was very tough for me in the beginning.

pip install pandas

In [ ]:
!pip install pandas

In [2]:
import pandas as pd

In [3]:
dff = pd.DataFrame({'id':[100, 101, 102],
                   'color':['red', 'blue', 'red']},
                    index=['a', 'b', 'c'])
dff

    id color
a  100   red
b  101  blue
c  102   red

# Loading in Data

In [4]:
df = pd.read_csv('RegularSeasonCompactResults.csv')
# df = pd.read_excel('RegularSeasonCompactResults.xlsx')

# The Basics

In [5]:
df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [6]:
df.tail()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [7]:
df['Season']

0         1985
1         1985
2         1985
3         1985
4         1985
          ...
145284    2016
145285    2016
145286    2016
145287    2016
145288    2016
Name: Season, Length: 145289, dtype: int64

In [8]:
df.Season

0         1985
1         1985
2         1985
3         1985
4         1985
          ...
145284    2016
145285    2016
145286    2016
145287    2016
145288    2016
Name: Season, Length: 145289, dtype: int64

In [9]:
temp = df.copy()

In [10]:
temp['new'] = temp.Wscore + temp.Lscore
temp.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot  new
0    1985      20   1228      81   1328      64    N      0  145
1    1985      25   1106      77   1354      70    H      0  147
2    1985      25   1112      63   1223      56    H      0  119
3    1985      25   1165      70   1432      54    H      0  124
4    1985      25   1192      86   1447      74    H      0  160

In [11]:
temp.shape

(145289, 9)

## How do I handle missing values in pandas?

In [12]:
temp.tail()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot  new
145284    2016     132   1114      70   1419      50    N      0  120
145285    2016     132   1163      72   1272      58    N      0  130
145286    2016     132   1246      82   1401      77    N      1  159
145287    2016     132   1277      66   1345      62    N      0  128
145288    2016     132   1386      87   1433      74    N      0  161

In [13]:
temp.notnull().tail()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore  Wloc  Numot   new
145284    True    True   True    True   True    True  True   True  True
145285    True    True   True    True   True    True  True   True  True
145286    True    True   True    True   True    True  True   True  True
145287    True    True   True    True   True    True  True   True  True
145288    True    True   True    True   True    True  True   True  True

In [14]:
temp.isnull().sum()

Season    0
Daynum    0
Wteam     0
Wscore    0
Lteam     0
Lscore    0
Wloc      0
Numot     0
new       0
dtype: int64

In [15]:
temp[temp.Wteam.isnull()].head()

Empty DataFrame
Columns: [Season, Daynum, Wteam, Wscore, Lteam, Lscore, Wloc, Numot, new]
Index: []

In [16]:
temp['Season'].fillna(value=2000, inplace=True)

In [17]:
temp.dropna(how='all', inplace=True)

## How do I use string methods in pandas?

In [18]:
temp.Wloc.replace('H', 'HH').head()

0     N
1    HH
2    HH
3    HH
4    HH
Name: Wloc, dtype: object

In [19]:
temp.Wloc.str.lower().head()

0    n
1    h
2    h
3    h
4    h
Name: Wloc, dtype: object

In [20]:
temp.Wloc.replace('H', 'HH').str.lower().head()

0     n
1    hh
2    hh
3    hh
4    hh
Name: Wloc, dtype: object

## How do I rename columns in a pandas DataFrame?

In [21]:
temp.rename(columns={'new':'Total_score'}, inplace=True)
temp.head(3)

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot  Total_score
0    1985      20   1228      81   1328      64    N      0          145
1    1985      25   1106      77   1354      70    H      0          147
2    1985      25   1112      63   1223      56    H      0          119

In [22]:
# temp.columns = ['a','b','c','d','e','f','g','h','i']
# temp.head(3)

## How do I change the data type of a pandas Series?

In [23]:
temp.dtypes

Season          int64
Daynum          int64
Wteam           int64
Wscore          int64
Lteam           int64
Lscore          int64
Wloc           object
Numot           int64
Total_score     int64
dtype: object

In [24]:
temp.Season = temp.Season.astype(str)
temp.dtypes

Season         object
Daynum          int64
Wteam           int64
Wscore          int64
Lteam           int64
Lscore          int64
Wloc           object
Numot           int64
Total_score     int64
dtype: object

In [25]:
temp.Season.str.replace('1', '2').astype(float).mean()

2420.687815319811

In [26]:
df['Wloc'] = df.Wloc.astype('category')
df.dtypes

Season       int64
Daynum       int64
Wteam        int64
Wscore       int64
Lteam        int64
Lscore       int64
Wloc      category
Numot        int64
dtype: object

In [27]:
df.Wloc.cat.codes.head()

0    2
1    1
2    1
3    1
4    1
dtype: int8

In [28]:
df.Wloc.cat.categories

Index(['A', 'H', 'N'], dtype='object')

In [29]:
df.shape

(145289, 8)

In [30]:
df.columns.tolist()

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [31]:
df.describe()

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Numot
count,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000
mean,2001.574834,75.223816,1286.720646,76.600321,1282.864064,64.497009,0.044387
std,9.233342,33.287418,104.570275,12.173033,104.829234,11.380625,0.247819
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1994.000000,47.000000,1198.000000,68.000000,1191.000000,57.000000,0.000000
50%,2002.000000,78.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2010.000000,103.000000,1379.000000,84.000000,1375.000000,72.000000,0.000000
max,2016.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,6.000000

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145289 entries, 0 to 145288
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Season  145289 non-null  int64
 1   Daynum  145289 non-null  int64
 2   Wteam   145289 non-null  int64
 3   Wscore  145289 non-null  int64
 4   Lteam   145289 non-null  int64
 5   Lscore  145289 non-null  int64
 6   Wloc    145289 non-null  category
 7   Numot   145289 non-null  int64
dtypes: category(1), int64(7)
memory usage: 7.9 MB

In [33]:
df.memory_usage(deep=True)

Index         128
Season    1162312
Daynum    1162312
Wteam     1162312
Wscore    1162312
Lteam     1162312
Lscore    1162312
Wloc       145555
Numot     1162312
dtype: int64

In [34]:
df.max()

Season    2016
Daynum     132
Wteam     1464
Wscore     186
Lteam     1464
Lscore     150
Wloc         N
Numot        6
dtype: object

In [35]:
df['Wscore'].max()

186

In [36]:
df['Lscore'].mean()

64.49700940883343

In [37]:
df['Wscore'].argmax()

24970

In [38]:
df.Season.value_counts(dropna=False)

2016    5369
2014    5362
2015    5354
2013    5320
2010    5263
2012    5253
2009    5249
2011    5246
2008    5163
2007    5043
2006    4757
2005    4675
2003    4616
2004    4571
2002    4555
2000    4519
2001    4467
1999    4222
1998    4167
1997    4155
1992    4127
1991    4123
1996    4122
1995    4077
1994    4060
1990    4045
1989    4037
1993    3982
1988    3955
1987    3915
1986    3783
1985    3737
Name: Season, dtype: int64

In [39]:
df.shape

(145289, 8)

In [40]:
df.Season.value_counts(normalize=True)

2016    0.036954
2014    0.036906
2015    0.036851
2013    0.036617
2010    0.036224
2012    0.036156
2009    0.036128
2011    0.036107
2008    0.035536
2007    0.034710
2006    0.032742
2005    0.032177
2003    0.031771
2004    0.031461
2002    0.031351
2000    0.031104
2001    0.030746
1999    0.029059
1998    0.028681
1997    0.028598
1992    0.028405
1991    0.028378
1996    0.028371
1995    0.028061
1994    0.027944
1990    0.027841
1989    0.027786
1993    0.027407
1988    0.027222
1987    0.026946
1986    0.026038
1985    0.025721
Name: Season, dtype: float64

In [41]:
df.Season.value_counts(normalize=True).index

Int64Index([2016, 2014, 2015, 2013, 2010, 2012, 2009, 2011, 2008, 2007, 2006,
            2005, 2003, 2004, 2002, 2000, 2001, 1999, 1998, 1997, 1992, 1991,
            1996, 1995, 1994, 1990, 1989, 1993, 1988, 1987, 1986, 1985],
           dtype='int64')

In [42]:
df.Season.value_counts(normalize=True).values

array([0.03695393, 0.03690575, 0.03685069, 0.03661667, 0.03622435,
       0.03615552, 0.03612799, 0.03610734, 0.03553607, 0.03471013,
       0.03274164, 0.03217725, 0.03177116, 0.03146143, 0.03135131,
       0.03110352, 0.03074562, 0.02905932, 0.02868077, 0.02859817,
       0.02840545, 0.02837792, 0.02837104, 0.02806131, 0.0279443 ,
       0.02784106, 0.027786  , 0.02740744, 0.02722161, 0.02694629,
       0.02603776, 0.02572115])

In [43]:
df.Season.nunique()

32

In [44]:
df.Season.unique()

array([1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995,
       1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006,
       2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016],
      dtype=int64)

## What do I need to know about the pandas index?

In [45]:
df.index

RangeIndex(start=0, stop=145289, step=1)

In [46]:
df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [47]:
df.set_index('Daynum', inplace = True)
df.head()

        Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
Daynum
20        1985   1228      81   1328      64    N      0
25        1985   1106      77   1354      70    H      0
25        1985   1112      63   1223      56    H      0
25        1985   1165      70   1432      54    H      0
25        1985   1192      86   1447      74    H      0

In [48]:
df.index.name = None
df.head()

    Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
20    1985   1228      81   1328      64    N      0
25    1985   1106      77   1354      70    H      0
25    1985   1112      63   1223      56    H      0
25    1985   1165      70   1432      54    H      0
25    1985   1192      86   1447      74    H      0

In [49]:
df.index.name = 'Daynum'
df.reset_index(inplace = True)
df.head()

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0      20    1985   1228      81   1328      64    N      0
1      25    1985   1106      77   1354      70    H      0
2      25    1985   1112      63   1223      56    H      0
3      25    1985   1165      70   1432      54    H      0
4      25    1985   1192      86   1447      74    H      0

# Acessing Values

In [50]:
df.iloc[[24970]]

       Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
24970      68    1991   1258     186   1109     140    H      0

In [51]:
df.iloc[[df['Wscore'].argmax()]]

       Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
24970      68    1991   1258     186   1109     140    H      0

In [52]:
df.loc[24970, 'Wteam']

1258

In [53]:
df.iloc[[df['Wscore'].argmax()]]['Lscore']

24970    140
Name: Lscore, dtype: int64

In [54]:
df.iloc[:3]

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0      20    1985   1228      81   1328      64    N      0
1      25    1985   1106      77   1354      70    H      0
2      25    1985   1112      63   1223      56    H      0

In [55]:
df.loc[:3]

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0      20    1985   1228      81   1328      64    N      0
1      25    1985   1106      77   1354      70    H      0
2      25    1985   1112      63   1223      56    H      0
3      25    1985   1165      70   1432      54    H      0

In [56]:
df.loc[24970, 'Lscore']

140

In [57]:
df.at[df['Wscore'].argmax(), 'Lscore']

140

# Sorting

In [58]:
df.sort_values('Lscore', ascending=False).head()
# df.Lscore.sort_values().head()

       Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
17867      92    1989   1258     181   1109     150    H      0
16853      68    1989   1258     162   1109     144    A      0
22074      96    1990   1261     148   1258     141    H      0
24970      68    1991   1258     186   1109     140    H      0
1126       65    1985   1424     142   1429     140    A      0

# Filtering Rows Conditionally

In [59]:
df[df['Wscore'] > 150]

       Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
5269       75    1986   1258     151   1109     107    H      0
12046      40    1988   1328     152   1147      84    H      0
12355      52    1988   1328     151   1173      99    N      0
16040      40    1989   1328     152   1331     122    H      0
16853      68    1989   1258     162   1109     144    A      0
17867      92    1989   1258     181   1109     150    H      0
19653      30    1990   1328     173   1109     101    H      0
19971      38    1990   1258     152   1109     137    A      0
20022      40    1990   1116     166   1109     101    H      0
22145      97    1990   1258     157   1362     115    H      0
23582      26    1991   1318     152   1258     123    N      0
24341      47    1991   1328     172   1258     112    H      0
24970      68    1991   1258     186   1109     140    H      0
25656      84    1991   1106     151   1212      97    H      0
28687      54    1992   1261     159   1319      86    H      0
35023     112    1993   1380     155   1341      91    A      0
40060      32    1995   1375     156   1341     114    H      0
52600      33    1998   1395     153   1410      87    H      0

In [60]:
df[(df['Wscore'] > 150) & (df['Lscore'] < 100)]

       Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
12046      40    1988   1328     152   1147      84    H      0
12355      52    1988   1328     151   1173      99    N      0
25656      84    1991   1106     151   1212      97    H      0
28687      54    1992   1261     159   1319      86    H      0
35023     112    1993   1380     155   1341      91    A      0
52600      33    1998   1395     153   1410      87    H      0

In [61]:
df[df.Daynum.isin([40, 41])].head(10)

     Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
407      40    1985   1102      85   1109      56    H      0
408      40    1985   1110      70   1162      56    N      0
409      40    1985   1112      82   1319      61    A      0
410      40    1985   1113      71   1462      67    H      0
411      40    1985   1114      76   1209      68    N      0
412      40    1985   1116      70   1283      56    H      0
413      40    1985   1120      70   1273      69    H      0
414      40    1985   1129      81   1152      61    H      0
415      40    1985   1132      55   1263      53    N      0
416      40    1985   1134      59   1432      56    H      0

# Grouping

In [62]:
df.groupby('Wteam').Wscore.mean().head()

Wteam
1101    78.111111
1102    69.893204
1103    75.839768
1104    75.825944
1105    74.960894
Name: Wscore, dtype: float64

In [63]:
df.groupby('Wteam').Wscore.agg(['count', 'mean', 'min', 'max']).head()

       count       mean  min  max
Wteam
1101      18  78.111111   62   95
1102     309  69.893204   42  111
1103     518  75.839768   48  109
1104     609  75.825944   42  114
1105     179  74.960894   51  114

# Dataframe Iteration

In [64]:
for index, row in df.iterrows():
    print(row)
    if index == 2:
        break

Daynum      20
Season    1985
Wteam     1228
Wscore      81
Lteam     1328
Lscore      64
Wloc         N
Numot        0
Name: 0, dtype: object
Daynum      25
Season    1985
Wteam     1106
Wscore      77
Lteam     1354
Lscore      70
Wloc         H
Numot        0
Name: 1, dtype: object
Daynum      25
Season    1985
Wteam     1112
Wscore      63
Lteam     1223
Lscore      56
Wloc         H
Numot        0
Name: 2, dtype: object

# Extracting Rows and Columns

In [65]:
df[['Wscore', 'Lscore']].head()

   Wscore  Lscore
0      81      64
1      77      70
2      63      56
3      70      54
4      86      74

## How do I remove columns from a pandas DataFrame?

In [66]:
df.drop(['Daynum', 'Wteam'], axis=1, inplace=False).head()

   Season  Wscore  Lteam  Lscore Wloc  Numot
0    1985      81   1328      64    N      0
1    1985      77   1354      70    H      0
2    1985      63   1223      56    H      0
3    1985      70   1432      54    H      0
4    1985      86   1447      74    H      0

In [67]:
df.drop([0, 2], axis = 0, inplace = False).head()

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
1      25    1985   1106      77   1354      70    H      0
3      25    1985   1165      70   1432      54    H      0
4      25    1985   1192      86   1447      74    H      0
5      25    1985   1218      79   1337      78    H      0
6      25    1985   1228      64   1226      44    N      0

## save a DataFrame to disk

In [68]:
df.to_csv('df.csv', header=False, index=False)

In [69]:
df.to_pickle('df.pkl')

In [70]:
pd.read_pickle('df.pkl').head()

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0      20    1985   1228      81   1328      64    N      0
1      25    1985   1106      77   1354      70    H      0
2      25    1985   1112      63   1223      56    H      0
3      25    1985   1165      70   1432      54    H      0
4      25    1985   1192      86   1447      74    H      0

##  How do I randomly sample rows from a DataFrame?

In [71]:
df.sample(n=3)

        Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
113072     123    2010   1293      55   1183      51    N      0
56350       19    1999   1291      92   1247      88    H      0
129720      15    2014   1184      82   1105      68    H      0

In [72]:
df.sample(n=3, random_state=42)

        Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
101566     100    2008   1329      93   1124      83    H      0
141343      41    2016   1199      75   1368      58    H      0
48348       35    1997   1314     106   1126      62    H      0

In [73]:
df.sample(frac=0.05, random_state=42)

        Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
101566     100    2008   1329      93   1124      83    H      0
141343      41    2016   1199      75   1368      58    H      0
48348       35    1997   1314     106   1126      62    H      0
120371      51    2012   1332      74   1341      66    H      0
97360      122    2007   1232      68   1229      65    N      0
...        ...     ...    ...     ...    ...     ...  ...    ...
56789       33    1999   1263      91   1135      72    A      0
15815       35    1989   1131      81   1132      69    H      0
26210       96    1991   1337      72   1362      57    H      0
83645       26    2005   1228      89   1211      72    N      0
130651      40    2014   1159      69   1107      60    A      0

[7264 rows x 8 columns]

## How do I create dummy variables in pandas?

In [74]:
df.Wloc.unique()

[N, H, A]
Categories (3, object): [N, H, A]

In [75]:
df.Wloc.map({'N': 'Nit', 'H': "Heat", 'A': "Aa"})

0          Nit
1         Heat
2         Heat
3         Heat
4         Heat
          ...
145284     Nit
145285     Nit
145286     Nit
145287     Nit
145288     Nit
Name: Wloc, Length: 145289, dtype: category
Categories (3, object): [Aa, Heat, Nit]

In [76]:
pd.get_dummies(df.Wloc).head()

   A  H  N
0  0  0  1
1  0  1  0
2  0  1  0
3  0  1  0
4  0  1  0

## How do I find and remove duplicate rows in pandas?

In [77]:
df.head()

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0      20    1985   1228      81   1328      64    N      0
1      25    1985   1106      77   1354      70    H      0
2      25    1985   1112      63   1223      56    H      0
3      25    1985   1165      70   1432      54    H      0
4      25    1985   1192      86   1447      74    H      0

In [78]:
df.duplicated().sum()

0

In [79]:
df.Season.duplicated().sum()

145257

In [80]:
df.drop_duplicates()

        Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0           20    1985   1228      81   1328      64    N      0
1           25    1985   1106      77   1354      70    H      0
2           25    1985   1112      63   1223      56    H      0
3           25    1985   1165      70   1432      54    H      0
4           25    1985   1192      86   1447      74    H      0
...        ...     ...    ...     ...    ...     ...  ...    ...
145284     132    2016   1114      70   1419      50    N      0
145285     132    2016   1163      72   1272      58    N      0
145286     132    2016   1246      82   1401      77    N      1
145287     132    2016   1277      66   1345      62    N      0
145288     132    2016   1386      87   1433      74    N      0

[145289 rows x 8 columns]